#### Terraform Initialization `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Security group for Application Load Balancer (public subnets)"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP from internet (redirect to HTTPS)"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS from internet"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "caremate-dev-sg-alb-01"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-sg-alb-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + tags_all               = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-sg-alb-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.eks_nodes will be created
  + resource "aws_security_group" "eks_nodes" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS worker nodes (private subnets only)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "All traffic from EKS nodes"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
      + name                   = "caremate-dev-sg-eks-nodes-01"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Auto-disable"                              = "yes"
          + "CostCenter"                                = "fhs"
          + "Environment"                               = "dev"
          + "ManagedBy"                                 = "terraform"
          + "Name"                                      = "caremate-dev-sg-eks-nodes-01"
          + "Owner"                                     = "fhs"
          + "Project"                                   = "caremate"
          + "Team"                                      = "ai-demo"
          + "kubernetes.io/cluster/caremate-dev-eks-01" = "owned"
        }
      + tags_all               = {
          + "Auto-disable"                              = "yes"
          + "CostCenter"                                = "fhs"
          + "Environment"                               = "dev"
          + "ManagedBy"                                 = "terraform"
          + "Name"                                      = "caremate-dev-sg-eks-nodes-01"
          + "Owner"                                     = "fhs"
          + "Project"                                   = "caremate"
          + "Team"                                      = "ai-demo"
          + "kubernetes.io/cluster/caremate-dev-eks-01" = "owned"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "Security group for RDS PostgreSQL (database subnet)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow health checks"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "PostgreSQL from EKS nodes"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = "caremate-dev-sg-rds-01"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-sg-rds-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + tags_all               = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-sg-rds-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.redis will be created
  + resource "aws_security_group" "redis" {
      + arn                    = (known after apply)
      + description            = "Security group for ElastiCache Redis (database subnet)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow health checks"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Redis from EKS nodes"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = "caremate-dev-sg-redis-01"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-sg-redis-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + tags_all               = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-sg-redis-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.alb_to_eks_nodes will be created
  + resource "aws_security_group_rule" "alb_to_eks_nodes" {
      + description              = "To EKS nodes"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # aws_security_group_rule.eks_nodes_from_alb will be created
  + resource "aws_security_group_rule" "eks_nodes_from_alb" {
      + description              = "HTTP from ALB"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.vpc.aws_db_subnet_group.database[0] will be created
  + resource "aws_db_subnet_group" "database" {
      + arn                     = (known after apply)
      + description             = "Database subnet group for caremate-dev-vpc-01"
      + id                      = (known after apply)
      + name                    = "caremate-dev-vpc-01"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + tags_all                = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + vpc_id                  = (known after apply)
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + tags_all               = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + tags_all               = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + tags_all               = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + tags_all             = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + tags_all = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + tags_all                           = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + tags_all         = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + tags_all         = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[0] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[1] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[2] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.database[0] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.21.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
          + "Tier"         = "database"
        }
      + tags_all                                       = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
          + "Tier"         = "database"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.database[1] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.22.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
          + "Tier"         = "database"
        }
      + tags_all                                       = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
          + "Tier"         = "database"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.database[2] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.23.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
          + "Tier"         = "database"
        }
      + tags_all                                       = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
          + "Tier"         = "database"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Auto-disable"                              = "yes"
          + "CostCenter"                                = "fhs"
          + "Environment"                               = "dev"
          + "ManagedBy"                                 = "terraform"
          + "Name"                                      = "caremate-dev-vpc-01"
          + "Owner"                                     = "fhs"
          + "Project"                                   = "caremate"
          + "Team"                                      = "ai-demo"
          + "Tier"                                      = "private"
          + "kubernetes.io/cluster/caremate-dev-eks-01" = "shared"
          + "kubernetes.io/role/internal-elb"           = "1"
        }
      + tags_all                                       = {
          + "Auto-disable"                              = "yes"
          + "CostCenter"                                = "fhs"
          + "Environment"                               = "dev"
          + "ManagedBy"                                 = "terraform"
          + "Name"                                      = "caremate-dev-vpc-01"
          + "Owner"                                     = "fhs"
          + "Project"                                   = "caremate"
          + "Team"                                      = "ai-demo"
          + "Tier"                                      = "private"
          + "kubernetes.io/cluster/caremate-dev-eks-01" = "shared"
          + "kubernetes.io/role/internal-elb"           = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Auto-disable"                              = "yes"
          + "CostCenter"                                = "fhs"
          + "Environment"                               = "dev"
          + "ManagedBy"                                 = "terraform"
          + "Name"                                      = "caremate-dev-vpc-01"
          + "Owner"                                     = "fhs"
          + "Project"                                   = "caremate"
          + "Team"                                      = "ai-demo"
          + "Tier"                                      = "private"
          + "kubernetes.io/cluster/caremate-dev-eks-01" = "shared"
          + "kubernetes.io/role/internal-elb"           = "1"
        }
      + tags_all                                       = {
          + "Auto-disable"                              = "yes"
          + "CostCenter"                                = "fhs"
          + "Environment"                               = "dev"
          + "ManagedBy"                                 = "terraform"
          + "Name"                                      = "caremate-dev-vpc-01"
          + "Owner"                                     = "fhs"
          + "Project"                                   = "caremate"
          + "Team"                                      = "ai-demo"
          + "Tier"                                      = "private"
          + "kubernetes.io/cluster/caremate-dev-eks-01" = "shared"
          + "kubernetes.io/role/internal-elb"           = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Auto-disable"                              = "yes"
          + "CostCenter"                                = "fhs"
          + "Environment"                               = "dev"
          + "ManagedBy"                                 = "terraform"
          + "Name"                                      = "caremate-dev-vpc-01"
          + "Owner"                                     = "fhs"
          + "Project"                                   = "caremate"
          + "Team"                                      = "ai-demo"
          + "Tier"                                      = "private"
          + "kubernetes.io/cluster/caremate-dev-eks-01" = "shared"
          + "kubernetes.io/role/internal-elb"           = "1"
        }
      + tags_all                                       = {
          + "Auto-disable"                              = "yes"
          + "CostCenter"                                = "fhs"
          + "Environment"                               = "dev"
          + "ManagedBy"                                 = "terraform"
          + "Name"                                      = "caremate-dev-vpc-01"
          + "Owner"                                     = "fhs"
          + "Project"                                   = "caremate"
          + "Team"                                      = "ai-demo"
          + "Tier"                                      = "private"
          + "kubernetes.io/cluster/caremate-dev-eks-01" = "shared"
          + "kubernetes.io/role/internal-elb"           = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Auto-disable"                              = "yes"
          + "CostCenter"                                = "fhs"
          + "Environment"                               = "dev"
          + "ManagedBy"                                 = "terraform"
          + "Name"                                      = "caremate-dev-vpc-01"
          + "Owner"                                     = "fhs"
          + "Project"                                   = "caremate"
          + "Team"                                      = "ai-demo"
          + "Tier"                                      = "public"
          + "kubernetes.io/cluster/caremate-dev-eks-01" = "shared"
          + "kubernetes.io/role/elb"                    = "1"
        }
      + tags_all                                       = {
          + "Auto-disable"                              = "yes"
          + "CostCenter"                                = "fhs"
          + "Environment"                               = "dev"
          + "ManagedBy"                                 = "terraform"
          + "Name"                                      = "caremate-dev-vpc-01"
          + "Owner"                                     = "fhs"
          + "Project"                                   = "caremate"
          + "Team"                                      = "ai-demo"
          + "Tier"                                      = "public"
          + "kubernetes.io/cluster/caremate-dev-eks-01" = "shared"
          + "kubernetes.io/role/elb"                    = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Auto-disable"                              = "yes"
          + "CostCenter"                                = "fhs"
          + "Environment"                               = "dev"
          + "ManagedBy"                                 = "terraform"
          + "Name"                                      = "caremate-dev-vpc-01"
          + "Owner"                                     = "fhs"
          + "Project"                                   = "caremate"
          + "Team"                                      = "ai-demo"
          + "Tier"                                      = "public"
          + "kubernetes.io/cluster/caremate-dev-eks-01" = "shared"
          + "kubernetes.io/role/elb"                    = "1"
        }
      + tags_all                                       = {
          + "Auto-disable"                              = "yes"
          + "CostCenter"                                = "fhs"
          + "Environment"                               = "dev"
          + "ManagedBy"                                 = "terraform"
          + "Name"                                      = "caremate-dev-vpc-01"
          + "Owner"                                     = "fhs"
          + "Project"                                   = "caremate"
          + "Team"                                      = "ai-demo"
          + "Tier"                                      = "public"
          + "kubernetes.io/cluster/caremate-dev-eks-01" = "shared"
          + "kubernetes.io/role/elb"                    = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Auto-disable"                              = "yes"
          + "CostCenter"                                = "fhs"
          + "Environment"                               = "dev"
          + "ManagedBy"                                 = "terraform"
          + "Name"                                      = "caremate-dev-vpc-01"
          + "Owner"                                     = "fhs"
          + "Project"                                   = "caremate"
          + "Team"                                      = "ai-demo"
          + "Tier"                                      = "public"
          + "kubernetes.io/cluster/caremate-dev-eks-01" = "shared"
          + "kubernetes.io/role/elb"                    = "1"
        }
      + tags_all                                       = {
          + "Auto-disable"                              = "yes"
          + "CostCenter"                                = "fhs"
          + "Environment"                               = "dev"
          + "ManagedBy"                                 = "terraform"
          + "Name"                                      = "caremate-dev-vpc-01"
          + "Owner"                                     = "fhs"
          + "Project"                                   = "caremate"
          + "Team"                                      = "ai-demo"
          + "Tier"                                      = "public"
          + "kubernetes.io/cluster/caremate-dev-eks-01" = "shared"
          + "kubernetes.io/role/elb"                    = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
      + tags_all                             = {
          + "Auto-disable" = "yes"
          + "CostCenter"   = "fhs"
          + "Environment"  = "dev"
          + "ManagedBy"    = "terraform"
          + "Name"         = "caremate-dev-vpc-01"
          + "Owner"        = "fhs"
          + "Project"      = "caremate"
          + "Team"         = "ai-demo"
        }
    }

Plan: 36 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + database_subnet_ids = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_subnet_ids  = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_ids   = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + vpc_cidr            = "10.0.0.0/16"
  + vpc_id              = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @tuanpa2295, AWS Region: `ap-southeast-1`*

**Next Steps:**
- Review the plan carefully
- Merge PR to trigger terraform apply (requires manual approval)